// pages/price_list/price_list.js
var eapi = getApp().url.url_api;
var alert = getApp().alert;
var loading = getApp().loading;
var Toast = getApp().Toast;
var share = getApp().share;
Page({

  /**
   * 页面的初始数据
   */
  data: {
    price: [
      [
        ['洗鞋', '价格/元', '洗护周期'],
        ['拖鞋', '31.00', ''],
        ['棉鞋', '39.00', ''],
        ['运动鞋（光面皮革）', '39.00', ''],
        ['运动鞋（半光面）', '31.00', ''],
        ['运动鞋（全绒面）', '49.00', ''],
        ['运动鞋（普通面料）', '39.00', ''],
        ['绒面靴（短款）', '49.00', ''],
        ['绒面靴（中款）', '59.00', ''],
        ['绒面靴（长款）', '69.00', ''],
      ],
      [
        ['上衣', '价格/元', '洗护周期'],
        ['衬衫', '15.00', ''],
        ['真丝衬衣', '39.00', ''],
        ['保暖衬衣', '25.00', ''],
        ['T恤', '19.00', ''],
        ['西装', '25.00', ''],
        ['西装背心', '12.00', ''],
        ['毛背心', '29.00', ''],
        ['棉/羽绒背心', '29.00', ''],
        ['毛衣', '29.00', ''],
        ['卫衣', '25.00', ''],
        ['单睡衣', '29.00', ''],
        ['棉睡衣', '29.00', ''],
        ['保暖衣', '25.00', ''],
        ['风衣', '49.00', ''],
        ['冲锋衣（含内胆）', '39.00', ''],
        ['冲锋衣（无内胆）', '29.00', ''],
        ['羊毛外套', '49.00', ''],
        ['羽绒服', '49.00', ''],
        ['皮草外套', '210.00', ''],
      ],
      [
        ['裤裙', '价格/元', '洗护周期'],
        ['西裤', '16.00', ''],
        ['牛仔裤', '28.00', ''],
        ['休闲裤', '16.00', ''],
        ['保暖裤/毛裤', '29.00', ''],
        ['棉裤/羽绒裤', '29.00', ''],
        ['连体裤', '29.00', ''],
        ['短裤', '19.00', ''],
        ['长裙', '39.00', ''],
        ['短裙', '25.00', ''],
        ['连衣裙', '42.00', ''],
        ['真丝裙', '39.00', ''],
        ['棉睡裤', '29.00', ''],
        ['单睡裤', '12.00', ''],
        ['睡袍', '49.00', ''],
        ['普通睡裙', '39.00', ''],
      ],
      [
        ['配饰', '价格/元', '洗护周期'],
        ['围巾', '15.00', ''],
        ['披肩', '10.00', ''],
        ['丝巾', '15.00', ''],
        ['贴身背心', '19.00', ''],
        ['领带', '15.00', ''],
        ['女士内衣', '12.00', ''],
        ['内裤', '5.00', ''],
        ['短袜', '5.00', ''],
      ],
      [
        ['家纺', '价格/元', '洗护周期'],
        ['床单/床笠', '19.00', ''],
        ['软床垫/床褥', '59.00', ''],
        ['毛毯', '59.00', ''],
        // ['窗帘', '15.00', ''],
        ['被子', '59.00', ''],
      ],
    ],
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    var that=this;
    getApp().login(eapi, that);//授权
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
    return {
      title: share().title,
      path: share().path,
      imageUrl: share().imageUrl,
    }
  },
})